"""

Домашнее задание №1

Условный оператор: Возраст

* Попросить пользователя ввести возраст при помощи input и положить 
  результат в переменную
* Написать функцию, которая по возрасту определит, чем должен заниматься пользователь: 
  учиться в детском саду, школе, ВУЗе или работать
* Вызвать функцию, передав ей возраст пользователя и положить результат 
  работы функции в переменную
* Вывести содержимое переменной на экран

"""

age = int(input())


def main():
    if age < 7:
        res = "Детский сад"
    elif age < 18:
        res = "Школа"
    elif age < 23:
        res = "ВУЗ"
    else:
        res = "Работа в компании"
    print(res)


if __name__ == "__main__":
    main()
