"""

Домашнее задание №1

Условный оператор: Сравнение строк

* Написать функцию, которая принимает на вход две строки
* Проверить, является ли то, что передано функции, строками. 
  Если нет - вернуть 0
* Если строки одинаковые, вернуть 1
* Если строки разные и первая длиннее, вернуть 2
* Если строки разные и вторая строка 'learn', возвращает 3
* Вызвать функцию несколько раз, передавая ей разные праметры 
  и выводя на экран результаты

"""

povtor = int(input())


def main(st1, st2):
    if st1 != str(st1) and st2 != str(st2):
        print(0)
        return
    elif len(st1) == len(st2):
        print(1)
        return
    elif len(st1) > len(st2):
        print(2)
        return
    elif st2 == "learn":
        print(3)
        return


for i in range(povtor):
    if __name__ == "__main__":
        main(input(), input())
